import SectionWithImage from "~/components/modules/auth/SectionWithImage";
import LogoImage from "/assets/images/rome.png";
import PolicyImage1 from "/assets/images/pana.png";
import PolicyImage2 from "/assets/images/Illustration.png";
import PolicyImage3 from "/assets/images/Art.png";
import PolicyImage4 from "/assets/images/rafiki.png";


export default function LoginForm() {
  return (
      <div className="flex-col items-center ">
        <header className="w-full bg-white shadow-sm border-b border-gray-200">
          <div className="mx-auto flex items-center justify-between px-6">
            <div className="flex items-center space-x-2">
            <img
            src={LogoImage}
            alt="logo"
            width={60}
            height={60}
            className="w-full h-[60px] object-contain"
          />            
          </div>

            <div className="flex space-x-2">
              <button className="rounded-md bg-black text-white font-medium px-3 py-1.5 hover:bg-gray-800 transition">
                นโยบายเว็บไซต์
              </button>
              <button className="rounded-md border border-gray-300 bg-gray-200 text-black-700 font-medium px-3 py-1.5 hover:bg-gray-700 transition">
                นโยบายการรักษาความมั่นคงปลอดภัย
              </button>
            </div>
          </div>
        </header>
        <div className="rounded-md mt-8 px-20 ">
          <h1 className="text-6xl font-bold text-center text-gray-900">
            นโยบายเว็บไซต์ (Website Policy)
          </h1>
          <div>
            <SectionWithImage
            title="1. วัตถุประสงค์ของเว็บไซต์"
            content={`เว็บไซต์นี้จัดทำขึ้นเพื่อให้บริการข้อมูล ข่าวสาร กิจกรรม ผลงาน และภารกิจของหน่วยงานแก่ประชาชนทั่วไป โดยมีวัตถุประสงค์เพื่อเผยแพร่ข้อมูลข่าวสารของหน่วยงานให้ประชาชนได้รับทราบอย่างถูกต้อง รวดเร็ว และโปร่งใส รวมถึงสนับสนุนให้ประชาชนเข้าถึงข้อมูลและบริการของภาครัฐได้สะดวกมากยิ่งขึ้น
              เว็บไซต์นี้ยังเป็นช่องทางสื่อสารระหว่างหน่วยงานกับประชาชน เพื่อรับฟังความคิดเห็นหรือข้อเสนอแนะที่เป็นประโยชน์ต่อการพัฒนาองค์กร โดยมุ่งหวังให้เว็บไซต์นี้เป็นศูนย์กลางข้อมูลออนไลน์ของหน่วยงานและเป็นสื่อกลางในการให้บริการข้อมูลสาธารณะอย่างมีประสิทธิภาพและปลอดภัย`}
            image={PolicyImage1}
            position="right"  
            />

            <SectionWithImage
            title="2. การใช้ข้อมูลในเว็บไซต์"
            content={`เนื้อหาทั้งหมดในเว็บไซต์นี้ เช่น ข้อความ บทความ ข่าวสาร ภาพถ่าย วิดีโอ เสียง โลโก้ ไฟล์กราฟิก และเอกสารทุกชนิด ถือเป็นทรัพย์สินทางปัญญาของหน่วยงาน การนำข้อมูลไปใช้ต้องอยู่ภายใต้เงื่อนไขดังนี้:
            • สามารถใช้ข้อมูลเพื่อประโยชน์ส่วนบุคคลหรือสาธารณะได้ โดยต้องอ้างอิงแหล่งที่มาชัดเจน
            • ห้ามนำข้อมูลไปใช้เพื่อวัตถุประสงค์ทางการค้า หรือในลักษณะที่อาจก่อให้เกิดความเสียหายต่อหน่วยงานหรือบุคคลอื่น
            • ห้ามทำซ้ำ ดัดแปลง แก้ไข หรือเผยแพร่ข้อมูลในเชิงพาณิชย์โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรจากหน่วยงาน
            หากตรวจพบการละเมิดลิขสิทธิ์หรือการนำข้อมูลไปใช้ในทางที่ไม่เหมาะสม หน่วยงานสงวนสิทธิ์ในการดำเนินการทางกฎหมายตามพระราชบัญญัติลิขสิทธิ์และกฎหมายอื่นที่เกี่ยวข้อง`}
            />

            <SectionWithImage
            title="3. ความถูกต้องของข้อมูล"
            content={`หน่วยงานมุ่งมั่นในการจัดเตรียมข้อมูลให้ถูกต้อง ครบถ้วน และเป็นปัจจุบัน อย่างไรก็ตามข้อมูลบางส่วนอาจมีการเปลี่ยนแปลงตามช่วงเวลา หน่วยงานไม่สามารถรับรองความถูกต้องหรือความครบถ้วนได้ทุกประการในขณะเข้าชม

            หน่วยงานขอสงวนสิทธิ์ในการปรับปรุง แก้ไข หรือยกเลิกข้อมูลโดยไม่ต้องแจ้งให้ทราบล่วงหน้า และไม่รับผิดชอบต่อผลที่เกิดจากการใช้ข้อมูลจากเว็บไซต์นี้โดยตรงหรือโดยอ้อม ผู้ใช้งานควรตรวจสอบข้อมูลจากแหล่งทางการก่อนนำไปใช้อ้างอิงหรือเผยแพร่ต่อ`}
            image={PolicyImage2}
            position="left"  
            />

            <SectionWithImage
            title="4. ลิงก์ไปยังเว็บไซต์ภายนอก"
            content={`เว็บไซต์นี้อาจมีลิงก์เชื่อมโยงไปยังเว็บไซต์ของหน่วยงานอื่นหรือเว็บไซต์ภายนอก เพื่ออำนวยความสะดวกแก่ผู้ใช้งาน อย่างไรก็ตาม หน่วยงานไม่มีอำนาจควบคุมหรือรับรองความถูกต้องของข้อมูลในเว็บไซต์ภายนอกเหล่านั้น\n
            การเชื่อมโยงดังกล่าวไม่ถือเป็นการรับรองหรือสนับสนุนเนื้อหาของเว็บไซต์ภายนอกในทางใด และหน่วยงานไม่รับผิดชอบต่อความเสียหายใด ๆ ที่เกิดจากการเข้าชมหรือใช้งานเว็บไซต์ภายนอกนั้น`}
            image={PolicyImage3}
            position="right"  
            />

            <SectionWithImage
            title="5. ลิงก์ไปยังเว็บไซต์ภายนอก"
            content={`หน่วยงานไม่รับผิดชอบต่อความเสียหายหรือความสูญเสียใด ๆ ที่เกิดขึ้นจากการใช้งานเว็บไซต์นี้ ไม่ว่าจะเป็นทางตรง ทางอ้อม หรือโดยผลสืบเนื่อง รวมถึง:
            • ความเสียหายต่อข้อมูลหรืออุปกรณ์ของผู้ใช้
            • ความล่าช้า ข้อผิดพลาด หรือการขาดการเชื่อมต่อของระบบที่เกิดจากเหตุทางเทคนิค
            • การโจมตีทางไซเบอร์ ไวรัส มัลแวร์ หรือภัยคุกคามอื่น ๆ ที่อาจเกิดขึ้นจากการดาวน์โหลดข้อมูล
            ผู้ใช้ควรมีมาตรการป้องกันข้อมูลของตนเอง เช่น ใช้ซอฟต์แวร์ป้องกันไวรัสและอัปเดตระบบอย่างสม่ำเสมอ เพื่อป้องกันความเสียหายจากการใช้งานเว็บไซต์`}
            />

            <SectionWithImage
            title="6. การปรับปรุงนโยบายเว็บไซต์"
            content={`หน่วยงานขอสงวนสิทธิ์ในการปรับปรุงหรือแก้ไขนโยบายเว็บไซต์นี้ได้ทุกเมื่อ โดยจะประกาศแจ้งให้ทราบผ่านหน้าเว็บไซต์เมื่อมีการเปลี่ยนแปลงที่สำคัญ ผู้ใช้ควรตรวจสอบนโยบายนี้เป็นระยะ เพื่อให้ทราบข้อกำหนดล่าสุดก่อนเข้าใช้งาน\n
            นโยบายนี้มีผลบังคับใช้ตั้งแต่วันที่ประกาศและถือเป็นแนวทางปฏิบัติสำหรับการใช้งานเว็บไซต์ของหน่วยงานโดยรวม`}
            image={PolicyImage4}
            position="left"  
            />
            
          </div>
          <div className="text-center pt-10">
            <button className="rounded-md bg-black text-white font-medium px-4 py-2 hover:bg-gray-800 transition">
              กลับไปหน้าเว็บไซต์
            </button>
            <p className="text-gray-500 text-sm mt-4">
              ปรับปรุงล่าสุด: 12 พฤศจิกายน 2568
            </p>
          </div>
        </div>
          
        
      </div>
  );
}

